import ContactPage from "@/components/ContactPage";

// app/contact/page.ts
export const metadata = {
  title: "Холбоо барих | Их таван нүдэн ХХК",
  description: `Их таван нүдэн ХХК-д холбоо барих – таны санал хүсэлт, асуулт, зөвлөгөөг хүлээн авч, 
  гадаад худалдаа, уул уурхай, хүнд даацын техник, барилгын материал, цэцэрлэгжүүлэлт зэрэг чиглэлээр 
  чанартай үйлчилгээ үзүүлдэг.`,
  metadataBase: new URL("https://ikhtavannuden.mn"),
  keywords: [
    "Их таван нүдэн ХХК",
    "холбоо барих Монгол",
    "гадаад худалдаа",
    "уул уурхай",
    "хүнд даацын техник",
    "барилгын материал",
    "цэцэрлэгжүүлэлт",
    "тусламж үйлчилгээ",
    "техник нийлүүлэлт",
    "чанартай үйлчилгээ",
  ],
  authors: [{ name: "Их таван нүдэн ХХК" }],
  openGraph: {
    title: "Холбоо барих | Их таван нүдэн ХХК",
    description: `Их таван нүдэн ХХК-д холбоо барих – таны санал хүсэлт, асуулт, зөвлөгөөг хүлээн авч, 
    гадаад худалдаа, уул уурхай, хүнд даацын техник, барилгын материал, цэцэрлэгжүүлэлт зэрэг чиглэлээр 
    чанартай үйлчилгээ үзүүлдэг.`,
    url: "https://ikhtavannuden.mn/contact",
    siteName: "Их таван нүдэн ХХК",
    locale: "mn_MN",
    type: "website",
  },
  twitter: {
    card: "summary_large_image",
    title: "Холбоо барих | Их таван нүдэн ХХК",
    description: `Их таван нүдэн ХХК-д холбоо барих – таны санал хүсэлт, асуулт, зөвлөгөөг хүлээн авч, 
    чанартай үйлчилгээ үзүүлдэг.`,
  },
};

const Contact = () => {
  return <ContactPage />;
};

export default Contact;
