import BlogPage from "@/components/BlogPage";

export const metadata = {
  title:
    "Хүнд даацын машин механизм | Барилгын материалын худалдаа | Цэцэрлэгжүүлэлт үйлчилгээ | Цэцэрлэгжүүлэлт",
  description: `Их таван нүдэн ХХК нь гадаад худалдаа, уул уурхай болон хүнд даацын техник, тоног төхөөрөмж, сэлбэг хэрэгсэл,
барилгын материалын худалдаа, цэцэрлэгжүүлэлт зэрэг чиглэлээр үйл ажиллагаа явуулдаг. 
Бид хэрэглэгчдэд найдвартай бүтээгдэхүүн, мэргэжлийн суурилуулалт болон засвар үйлчилгээний цогц шийдлийг хүргэдэг.`,
  metadataBase: new URL("https://ikhtavannuden.mn/news"),
};

const Blogs = () => {
  return (
    <div>
      <BlogPage />
    </div>
  );
};

export default Blogs;
