import ProjectPage from "@/components/ProjectPage";

export const metadata = {
  title:
    "Уул уурхайн тоног төхөөрөмж | Уул уурхайн экскаватор, ачигч, машин | Уул уурхайн тоног төхөөрөмж",
  description: `Их таван нүдэн ХХК нь гадаад худалдаа, уул уурхай болон хүнд даацын техник, тоног төхөөрөмж, сэлбэг хэрэгсэл,
барилгын материалын худалдаа, цэцэрлэгжүүлэлт зэрэг чиглэлээр үйл ажиллагаа явуулдаг. 
Бид хэрэглэгчдэд найдвартай бүтээгдэхүүн, мэргэжлийн суурилуулалт болон засвар үйлчилгээний цогц шийдлийг хүргэдэг.`,
  metadataBase: new URL("https://ikhtavannuden.mn/project"),
};

const Project = () => {
  return <ProjectPage />;
};

export default Project;
