import ProjectPage from "@/components/ProjectPage";

export const metadata = {
  title: "Үйлчилгээ | Их таван нүдэн ХХК",
  description: `Их таван нүдэн ХХК-ийн үйлчилгээнүүдийн талаар дэлгэрэнгүй мэдээллийг эндээс авна уу. 
  Бид гадаад худалдаа, уул уурхай, хүнд даацын техник, барилгын материал, цэцэрлэгжүүлэлт зэрэг чиглэлээр 
  чанартай тоног төхөөрөмж, үйлчилгээ үзүүлдэг.`,
  metadataBase: new URL("https://ikhtavannuden.mn"),
  keywords: [
    "Их таван нүдэн ХХК",
    "үйлчилгээ",
    "техник нийлүүлэлт",
    "газар шороо боловсруулах техник",
    "барилгын материал",
    "цэцэрлэгжүүлэлт",
    "гадаад худалдаа",
    "уул уурхай",
    "сэлбэг хэрэгсэл",
    "чанартай үйлчилгээ",
  ],
  authors: [{ name: "Их таван нүдэн ХХК" }],
  openGraph: {
    title: "Үйлчилгээ | Их таван нүдэн ХХК",
    description: `Их таван нүдэн ХХК-ийн үйлчилгээнүүдийн талаар дэлгэрэнгүй мэдээллийг эндээс авна уу. 
    Бид гадаад худалдаа, уул уурхай, хүнд даацын техник, барилгын материал, цэцэрлэгжүүлэлт зэрэг чиглэлээр 
    чанартай тоног төхөөрөмж, үйлчилгээ үзүүлдэг.`,
    url: "https://ikhtavannuden.mn/service",
    siteName: "Их таван нүдэн ХХК",
    locale: "mn_MN",
    type: "website",
  },
  twitter: {
    card: "summary_large_image",
    title: "Үйлчилгээ | Их таван нүдэн ХХК",
    description: `Их таван нүдэн ХХК-ийн үйлчилгээнүүдийн талаар дэлгэрэнгүй мэдээллийг эндээс авна уу.`,
  },
};

const Project = () => {
  return <ProjectPage />;
};

export default Project;
